In [1]:
import pandas as pd 
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df=sns.load_dataset("tips")

In [21]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [19]:
#1Q

active_smoker=df[df['smoker']=='Yes']

len(active_smoker)

93

In [9]:
(93/244)*200

76.22950819672131

In [16]:
b=len(['smoker'])
p=len(df[df['smoker']=='Yes'])
l=b/p*100
l

1.0752688172043012

In [22]:
#2Q
smoker=df[df['size']==3]
max(smoker['sex'])

'Male'

In [23]:
#3Q

df[df['sex']=='male'].mean()

C:\Users\SRAM30\AppData\Local\Temp\ipykernel_7244\2404448511.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df[df['sex']=='male'].mean()

total_bill   NaN
tip          NaN
size         NaN
dtype: float64

In [24]:
#6Q


sunday_avg=df[df['day']=='sun']['total_bill'].mean()
sat_avg=df[df['day']=='sat']['total_bill'].mean()
thu_avg=df[df['day']=='thur']['total_bill'].mean()
fri_avg=df[df['day']=='fri']['total_bill'].mean()


print("sunday avarage value",sunday_avg)
print("saturday avarage value",sat_avg)
print("thursday avarage value",thu_avg)
print("friday avarage value",fri_avg)

sunday avarage value nan
saturday avarage value nan
thursday avarage value nan
friday avarage value nan

In [25]:
#6Q

df.day.unique()

['Sun', 'Sat', 'Thur', 'Fri']
Categories (4, object): ['Thur', 'Fri', 'Sat', 'Sun']

In [10]:
import pandas as pd
sample={"manisha ready as very tring person"}
myvar=pd.DataFrame(sample)
print(myvar)

                                    0
0  manisha ready as very tring person

In [1]:
#4Q
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
df=sns.load_dataset("tips")

In [4]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [5]:
#4Q

df[df['size']==3]['sex'].mode()

0    Male
Name: sex, dtype: category
Categories (2, object): ['Male', 'Female']

In [6]:
#5Q

df['time'].mode()

0    Dinner
Name: time, dtype: category
Categories (2, object): ['Lunch', 'Dinner']

In [10]:
#9Q

df[df['sex']=='Female']['total_bill'].max()

44.3

In [9]:
df[df['sex']=='Male']['total_bill'].max()

50.81

In [11]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [12]:
#10Q
s=df[(df['sex']==44.3)==(df['sex']==50.81)]
max(s['sex'])

'Male'

In [13]:
df['smoker']

0       No
1       No
2       No
3       No
4       No
      ...
239     No
240    Yes
241    Yes
242     No
243     No
Name: smoker, Length: 244, dtype: category
Categories (2, object): ['Yes', 'No']

In [28]:
df[df['sex']=='female']['total_bill'].max()

nan

In [34]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt